# Biblioteca Pandas

In [1]:
import pandas as pd

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

## Series

In [4]:
data = [1,2,3,4,5]
index = ['red','brown','grey','black','blue']
my_series = pd.Series(data=data, index=index)
my_series

red      1
brown    2
grey     3
black    4
blue     5
dtype: int64

In [16]:
print(my_series['red'])
print(my_series.loc['red'])
print(my_series.iloc[0])

1
1
1

In [10]:
my_series.index.to_list()
my_series.index.to_numpy()
list(my_series)

[1, 2, 3, 4, 5]

## Series operations

In [26]:
# sum all elements
my_series.sum()
# numbers of elements (excepet None)
my_series.count()
# numbers of elements (None included)
my_series.size
# mean
my_series.mean()
# standart deviation
my_series.std()

1.5811388300841898

## Operation between Series

In [33]:
my_series = pd.Series([1,2,3,4,5])
my_series2 = pd.Series([element**2 for element in my_series])
my_series2

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [34]:
my_series + my_series2

0     2
1     6
2    12
3    20
4    30
dtype: int64

In [38]:
my_series3 = pd.Series(data=list(range(10)))
my_series + my_series3

0    1.0
1    3.0
2    5.0
3    7.0
4    9.0
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

# Filtering

In [39]:
my_series>1

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [41]:
my_series[my_series>1]

1    2
2    3
3    4
4    5
dtype: int64

In [44]:
my_series[(my_series>1) & (my_series<10)]

1    2
2    3
3    4
4    5
dtype: int64

# Data Frames

In [49]:
df = pd.DataFrame()
df['column1'] = [1,2,3,4,5]
df['column2'] = my_series2
df['column3'] = 10
df

   column1  column2  column3
0        1        1       10
1        2        4       10
2        3        9       10
3        4       16       10
4        5       25       10

In [54]:
_dict = {
    'column1': [1, 2, 3, 4, 5],
    'column2': [1, 4, 9, 16, 25],
    'column 3': [1, 8, 27, 64, 125]
}
df = pd.DataFrame(_dict)
df['column4'] = 10
df

   column1  column2  column 3  column4
0        1        1         1       10
1        2        4         8       10
2        3        9        27       10
3        4       16        64       10
4        5       25       125       10

### How to access Data Frame Series

In [57]:
df['column1']
df.column1 # not common
# access index
df.columns.tolist()

['column1', 'column2', 'column 3', 'column4']

In [58]:
df[['column1','column2']]

   column1  column2
0        1        1
1        2        4
2        3        9
3        4       16
4        5       25

In [63]:
df.iloc[2:4]

   column1  column2  column 3  column4
2        3        9        27       10
3        4       16        64       10

In [69]:
df['column1'].iloc[2] = 99
df.iloc[2,0] = 89
df

   column1  column2  column 3  column4
0        1        1        89       10
1        2        4         8       10
2       89        9        27       10
3        4       16        64       10
4        5       25       125       10

In [71]:
df[(df['column1']>1) & (df['column2']<25)]

   column1  column2  column 3  column4
1        2        4         8       10
2       89        9        27       10
3        4       16        64       10

## Operations between DataFrame Series

In [73]:
df['column5'] = df['column1'] + df['column2']
df

   column1  column2  column 3  column4  column5
0        1        1        89       10        2
1        2        4         8       10        6
2       89        9        27       10       98
3        4       16        64       10       20
4        5       25       125       10       30

In [79]:
df.iloc[0:2].sum().sum()

133